[
  {
    "title": "LAPD Crime Data Analysis",
    "type": "Data Architecture",
    "description": "An end-to-end data warehouse involving data cleaning, modelling, and PowerBI visualization.",
    "process": "In this project, I built an end-to-end data pipeline using the Medallion (Bronze-Silver-Gold) architecture to transform raw LAPD crime data into actionable insights via Power BI dashboards. After initializing the environment with SQL Server, I ingested raw CSV data into the Bronze layer for traceability. In the Silver layer, I cleaned and standardized the data using SQL, then normalized it into a Snowflake schema to improve data integrity and reduce redundancy. At the Gold layer, I denormalized the data into a Star schema optimized for analytics and built semantic Gold Views. These views powered a fully interactive Power BI dashboard featuring crime heatmaps, yearly trend analysis, and victim demographic insights. The structured approach ensured scalable data processing, robust modeling, and user-friendly visual reporting.",
    "stack": ["SQLServer", "Power BI", "Data Modelling"],
    "img1": "others/images/projects/p1/1.jpg",
    "img2": "others/images/projects/p1/2.jpg",
    "img3": "others/images/projects/p1/3.png",
    "code": "https://github.com/"
  },
  {
    "title": "COVID-19 Insights: Muntinlupa City 2020",
    "type": "Data Analytics",
    "description": "Data analysis of COVID-19 dataset focused in Muntinlupa City on 2020.",
    "process": "In this project, I extracted, cleaned, and analyzed over 1M rows of COVID-19 data using Microsoft Excel. I extracted the required data using MySQL and transformed the raw, extracted data using MS Excel. After cleaning, I developed an interactive Tableau dashboard to present key metrics such as recovery rate and incorporated cards, graphs, filters, and charts to visualize trends and patterns.",
    "stack": ["MS Excel", "Tableau", "MySQL"],
    "img1": "others/images/projects/p1/1.jpg",
    "img2": "others/images/projects/p1/2.jpg",
    "img3": "others/images/projects/p1/3.png",
    "code": "https://github.com/"
  },
  {
    "title": "Coffee Sales Dashboard",
    "type": "Data Analytics",
    "description": "Data analysis of a coffee sales dataset considering factors such as sales, order type, and order date.",
    "process": "The coffee sales dataset was given in a star schema via an Excel file with multiple sheets. I denormalized the dataset first using XLOOKUP and INDEX-MATCH functions and cleaned and transformed the data using IFs and other advanced functions. Afterward, I developed an Excel-based dashboard to visualize the trends and integrated slicers and filters to support user exploration.",
    "stack": ["MS Excel"],
    "img1": "others/images/projects/p1/1.jpg",
    "img2": "others/images/projects/p1/2.jpg",
    "img3": "others/images/projects/p1/3.png",
    "code": "https://github.com/"
  },
  {
    "title": "Visualizing Netflix: Trends and Ratings",
    "type": "Data Architecture",
    "description": "An end-to-end data analytics project involving the normalization and visualization of a Netflix dataset.",
    "process": "1. Preprocessing, 2. Model training, 3. Deployment pipeline",
    "stack": ["Python", "Scikit-learn", "Pandas"],
    "img1": "others/images/projects/p1/1.jpg",
    "img2": "others/images/projects/p1/2.jpg",
    "img3": "others/images/projects/p1/3.png",
    "code": "https://github.com/"
  }
]
